samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
void HAL_RADIO_TIMER_CpuWakeUpCallback(void)
{
  VTimer_Process_Schedule();
}

void HAL_RADIO_TxRxCallback(uint32_t flags)
{
  BLE_STACK_RadioHandler(flags);
  VTimer_Process_Schedule();
  NVM_Process_Schedule();
}

void BLE_STACK_ProcessRequest(void)
{
  BLEStack_Process_Schedule();
}

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  UTIL_SEQ_RegTask(1U << CFG_TASK_BLE_STACK, UTIL_SEQ_RFU, BLEStack_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_VTIMER, UTIL_SEQ_RFU, VTimer_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_NVM, UTIL_SEQ_RFU, NVM_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_ALARM_TIMEOUT_ID, UTIL_SEQ_RFU, APP_BLE_AlertTimeout);
  UTIL_SEQ_RegTask(1U << CFG_TASK_TILT_POLL_ID, UTIL_SEQ_RFU, APP_BLE_TiltPoll_Task);
  UTIL_SEQ_RegTask(1U << CFG_TASK_RAW_IMU_SEND_ID, UTIL_SEQ_RFU, APP_BLE_RawImuSend_Task);
  ModulesInit();

  BLE_Init();

  bleAppCtx.Device_Connection_Status = APP_BLE_IDLE;
  bleAppCtx.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

  tBleStatus status = Landslide_Service_Init();
  if(status != BLE_STATUS_SUCCESS){
	  APP_DBG_MSG("ERROR: Landslide service init failed: 0x%02X\n", status);
  }

  TiltPollTimerHandle.callback = APP_BLE_TiltPollTimer_Callback;
  HAL_RADIO_TIMER_StartVirtualTimer(&TiltPollTimerHandle, POLL_INTERVAL_CALIB_MS);

  RawImuTimerHandle.callback = APP_BLE_RawImuTimer_Callback;
  HAL_RADIO_TIMER_StartVirtualTimer(&RawImuTimerHandle, POLL_INTERVAL_CALIB_MS);

  for (uint8_t i = 0; i < NUM_ACCEPTED_DEVICES; i++)
  {
	  tBleStatus filt_status = aci_gap_add_devices_to_filter_accept_and_resolving_list(
	                                0x01,
	                                0x00,
	                                NUM_ACCEPTED_DEVICES,
	                                (List_Entry_t*)s_accepted_devices);
	    SEGGER_RTT_printf(0, "[FilterList] status=0x%02X\n", filt_status);
  }

  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);

  return;
}

void BLEEVT_App_Notification(const hci_pckt *hci_pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  hci_le_meta_event *p_meta_evt;
  void *event_data;

  UNUSED(ret);

  if(hci_pckt->type != HCI_EVENT_PKT_TYPE && hci_pckt->type != HCI_EVENT_EXT_PKT_TYPE)
  {
    return;
  }

  p_event_pckt = (hci_event_pckt*)hci_pckt->data;

  if(hci_pckt->type == HCI_EVENT_PKT_TYPE){
    event_data = p_event_pckt->data;
  }
  else {
    hci_event_ext_pckt *p_event_pckt = (hci_event_ext_pckt*)hci_pckt->data;
    event_data = p_event_pckt->data;
  }

  switch (p_event_pckt->evt)
  {
  case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      if (p_disconnection_complete_event->Connection_Handle == bleAppCtx.BleApplicationContext_legacy.connectionHandle)
      {
        bleAppCtx.BleApplicationContext_legacy.connectionHandle = 0xFFFF;
        bleAppCtx.Device_Connection_Status = APP_BLE_IDLE;
        APP_DBG_MSG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        APP_DBG_MSG("     - Connection Handle:   0x%02X\n     - Reason:    0x%02X\n",
                    p_disconnection_complete_event->Connection_Handle,
                    p_disconnection_complete_event->Reason);

        Landslide_Service_Disconnection();
        g_in_alert_mode = 0;
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
        SEGGER_RTT_printf(0, "Client Disconnected\n\n");
      }
      gap_cmd_resp_release();
    }
    break;

  case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (hci_le_meta_event*) p_event_pckt->data;
      switch (p_meta_evt->subevent)
      {
      case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      INT(p_conn_update_complete->Connection_Interval*1.25),
                      FRACTIONAL_2DIGITS(p_conn_update_complete->Connection_Interval*1.25),
                      p_conn_update_complete->Peripheral_Latency,
                      p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);
        }
        break;
      case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          gap_cmd_resp_release();

          SEGGER_RTT_printf(0, "PHY update: status=0x%02X TX=%d RX=%d (3=Coded)\n",
                                  p_le_phy_update_complete->Status,
                                  p_le_phy_update_complete->TX_PHY,
                                  p_le_phy_update_complete->RX_PHY);
        }
        break;
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;

          connection_complete_event(p_enhanced_conn_complete->Status,
                                    p_enhanced_conn_complete->Connection_Handle,
                                    p_enhanced_conn_complete->Peer_Address_Type,
                                    p_enhanced_conn_complete->Peer_Address,
                                    p_enhanced_conn_complete->Connection_Interval,
                                    p_enhanced_conn_complete->Peripheral_Latency,
                                    p_enhanced_conn_complete->Supervision_Timeout);
        }
        break;
      case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;

          connection_complete_event(p_conn_complete->Status,
                                    p_conn_complete->Connection_Handle,
                                    p_conn_complete->Peer_Address_Type,
                                    p_conn_complete->Peer_Address,
                                    p_conn_complete->Connection_Interval,
                                    p_conn_complete->Peripheral_Latency,
                                    p_conn_complete->Supervision_Timeout);
        }
        break;

      default:
        break;
      }
    }
    break;

