samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
  tBleStatus ret = hci_le_set_phy(Connection_Handle,
                        0,
						HCI_TX_PHYS_LE_1M_PREF,
						HCI_TX_PHYS_LE_1M_PREF,
                        0);
   if (ret != BLE_STATUS_SUCCESS) {
 	  SEGGER_RTT_printf(0, "hci_le_set_phy failed: 0x%02X\n", ret);
   }
   else {
 	  SEGGER_RTT_printf(0, "==>> hci_le_set_phy Coded S=8 requested\n");
   }
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return bleAppCtx.Device_Connection_Status;
}

void APP_BLE_Procedure_Gap_General(ProcGapGeneralId_t ProcGapGeneralId)
{
  tBleStatus status;

  switch(ProcGapGeneralId)
  {
#if (CFG_BLE_CONTROLLER_2M_CODED_PHY_ENABLED == 1)
    case PROC_GAP_GEN_PHY_TOGGLE:
    {
      uint8_t phy_tx, phy_rx;

      status = hci_le_read_phy(bleAppCtx.BleApplicationContext_legacy.connectionHandle, &phy_tx, &phy_rx);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("hci_le_read_phy failure: reason=0x%02X\n",status);
      }
      else
      {
        APP_DBG_MSG("==>> hci_le_read_phy - Success\n");
        APP_DBG_MSG("==>> PHY Param  TX= %d, RX= %d\n", phy_tx, phy_rx);
        if ((phy_tx == HCI_TX_PHY_LE_2M) && (phy_rx == HCI_RX_PHY_LE_2M))
        {
          status = hci_le_set_phy(bleAppCtx.BleApplicationContext_legacy.connectionHandle, 0, HCI_TX_PHYS_LE_1M_PREF, HCI_RX_PHYS_LE_1M_PREF, 0);
          if (status == BLE_STATUS_SUCCESS)
          {
            gap_cmd_resp_wait();
          }
        }
        else
        {
          status = hci_le_set_phy(bleAppCtx.BleApplicationContext_legacy.connectionHandle, 0, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF, 0);
          if (status == BLE_STATUS_SUCCESS)
          {
            gap_cmd_resp_wait();
          }
        }
      }
      break;
    }
#endif
    case PROC_GAP_GEN_CONN_TERMINATE:
    {
      status = aci_gap_terminate(bleAppCtx.BleApplicationContext_legacy.connectionHandle, BLE_ERROR_TERMINATED_REMOTE_USER);
      if (status == BLE_STATUS_SUCCESS)
      {
        gap_cmd_resp_wait();
      }
      break;
    }
    case PROC_GATT_EXCHANGE_CONFIG:
    {
      status = aci_gatt_clt_exchange_config(bleAppCtx.BleApplicationContext_legacy.connectionHandle);
      break;
    }
    default:
      break;
  }
  return;
}

void APP_BLE_Procedure_Gap_Peripheral(ProcGapPeripheralId_t ProcGapPeripheralId)
{
  tBleStatus status;
  uint32_t paramA = ADV_INTERVAL_MIN;
  uint32_t paramB = ADV_INTERVAL_MAX;
  uint32_t paramC, paramD;

  switch(ProcGapPeripheralId)
  {
    case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
    {
      paramA = ADV_INTERVAL_MIN;
      paramB = ADV_INTERVAL_MAX;
      paramC = APP_BLE_ADV_FAST;
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_START_LP:
    {
      paramA = ADV_LP_INTERVAL_MIN;
      paramB = ADV_LP_INTERVAL_MAX;
      paramC = APP_BLE_ADV_LP;
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      paramC = APP_BLE_IDLE;
      break;
    }
    case PROC_GAP_PERIPH_CONN_PARAM_UPDATE:
    {
      //paramA = CONN_INT_MS(2000);
      //paramB = CONN_INT_MS(4000);
      paramA = CONN_INT_MS(7.5);
      paramB = CONN_INT_MS(15);
      paramC = 0x0000;
      paramD = 0x01F4;
      break;
    }
    case PROC_GAP_PERIPH_CONN_TERMINATE:
    {
      status = aci_gap_terminate(bleAppCtx.BleApplicationContext_legacy.connectionHandle, 0x13);
      if (status == BLE_STATUS_SUCCESS)
      {
        gap_cmd_resp_wait();
      }
      break;
    }
    default:
      break;
  }

  switch(ProcGapPeripheralId)
  {
    case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
    case PROC_GAP_PERIPH_ADVERTISE_START_LP:
    {
      Advertising_Set_Parameters_t Advertising_Set_Parameters = {0};

      status = aci_gap_set_advertising_configuration(0,
    		  	  	  	  	  	  	  	  	  	  	 GAP_MODE_NON_DISCOVERABLE,
                                                     ADV_TYPE,
                                                     paramA,
                                                     paramB,
                                                     HCI_ADV_CH_ALL,
                                                     0,
                                                     NULL,
													 ADV_FILTER,
                                                     0,
                                                     HCI_PHY_LE_1M,
                                                     0,
													 HCI_PHY_LE_CODED,
                                                     0,
                                                     0);
      SEGGER_RTT_printf(0, "[AdvCfg] status=0x%02X\n", status);
      if (status == BLE_STATUS_SUCCESS)
      {
        bleAppCtx.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
      }

      status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*) a_AdvData);
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      status = aci_gap_set_advertising_enable(DISABLE, 0, NULL);
      if (status == BLE_STATUS_SUCCESS)
      {
        bleAppCtx.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
      }
      break;
    }
    case PROC_GAP_PERIPH_CONN_PARAM_UPDATE:
    {
       status = aci_l2cap_connection_parameter_update_req(
                                                       bleAppCtx.BleApplicationContext_legacy.connectionHandle,
                                                       paramA,
                                                       paramB,
                                                       paramC,
                                                       paramD);
      break;
    }
    case PROC_GAP_PERIPH_SET_BROADCAST_MODE:
    {
      break;
    }
    default:
      break;
  }
  return;
}

/* USER CODE BEGIN FD*/

static void APP_BLE_TiltPollTimer_Callback(void *context)
{
	(void) context;
	UTIL_SEQ_SetTask(1U << CFG_TASK_TILT_POLL_ID, CFG_SEQ_PRIO_1);
}

static void APP_BLE_RawImuTimer_Callback(void *context)
{
    (void)context;
    UTIL_SEQ_SetTask(1U << CFG_TASK_RAW_IMU_SEND_ID, CFG_SEQ_PRIO_1);

    uint32_t next_interval;

    if (TRAINING_MODE_ENABLED)
	{
		next_interval = TRAINING_MODE_RATE_MS;   /* raw IMU send = fast */
	}

    else if (s_imu_pending > 0U && rawImuValue.is_hist_burst != 0U)
    {
        next_interval = 1U;   // flush all at once
    }
    else
    {
        TiltState_t st = tilt_detector_get_state();
        if      (st == TILT_STATE_CRITICAL) next_interval = BROADCAST_CRITICAL_MS;
        else if (st == TILT_STATE_WARNING)  next_interval = BROADCAST_WARNING_MS;
        else if (st == TILT_STATE_CALIBRATING) next_interval = POLL_INTERVAL_CALIB_MS;
        else                                 next_interval = BROADCAST_NORMAL_MS;
    }

